Revit 2027 API
ComboBox.DropDownOpened Event
Subscribe to this event to be notified when the drop-down of the ComboBox is opened.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public event EventHandler<ComboBoxDropDownOpenedEventArgs> DropDownOpened
Public Event DropDownOpened As EventHandler(Of ComboBoxDropDownOpenedEventArgs)
public:
 event EventHandler<ComboBoxDropDownOpenedEventArgs^>^ DropDownOpened {
	void add (EventHandler<ComboBoxDropDownOpenedEventArgs^>^ value);
	void remove (EventHandler<ComboBoxDropDownOpenedEventArgs^>^ value);
}
member DropDownOpened : IEvent<EventHandler<ComboBoxDropDownOpenedEventArgs>,
    ComboBoxDropDownOpenedEventArgs>
Value
EventHandler<ComboBoxDropDownOpenedEventArgs>
See Also
Reference
ComboBox Class
Autodesk.Revit.UI Namespace